[
  {
    "author": "Hamster Granny",
    "rating": 5.0,
    "title": "Excellent but be aware of need for physio afterwards",
    "date": "2014-09-02",
    "location": "United Kingdom",
    "verified": true,
    "content": "Excellent quality and the best one I reckon. I had to wear the long one for six weeks, after a foot injury, then started physio but had a set back with tendon and had to start wearing one again a few hours a day, so ordered this shorter one which is much easier and lighter to wear, more manoevrability and easier to get on and off. It is fine for a foot injury. If you wear one of these all day every day then you will get muscle wastage quite quickly, and ankle losing flexibility, so should only really be used after medical advice (I checked with Consultant how long to wear it second time). I just wear it when going outside, until tendon is healed and still have a bit of muscle wastage. Really important to do physio exercises afterwards - so go and see a phsyio who will probably recommend a wobble board and some elastic stretchers as well as a range of exercises to do 3 times a day.\n\nUpdate: I forgot to say - it's important to find a shoe the right height for the other foot or you end up with hip pain! I had a pair of Wolky sandals and they are the perfect height!",
    "helpful_votes": 19
  },
  {
    "author": "Thelma",
    "rating": 5.0,
    "title": "as described.",
    "date": "2025-03-11",
    "location": "United Kingdom",
    "verified": true,
    "content": "Perfect for achilles tear.",
    "helpful_votes": 0
  },
  {
    "author": "Amazon Customer",
    "rating": 5.0,
    "title": "This boot is amazing! It provides support to the whole ankle and ...",
    "date": "2016-09-01",
    "location": "United Kingdom",
    "verified": true,
    "content": "I bought this to replace a moon boot i was provided by My healthcare provider who then promptly dostcharged me, unfortunately the combanation of a secondary inversion sprain, torne ligaments and tendons as well as bone busing has ment that 8 months down the line i still struggle to walk! This boot is amazing! It provides support to the whole ankle and foot, very comfy and you can adjust the amount of pressure u need to support it by inflating the air bags! Very plzd and would recoment to any one! Im a watress and can spend upto 12hrs on my feet this has meant that i havent been in pain once whilst working and can do my job again!",
    "helpful_votes": 0
  },
  {
    "author": "KMSB",
    "rating": 4.0,
    "title": "Comfortable boot!",
    "date": "2018-06-02",
    "location": "United Kingdom",
    "verified": true,
    "content": "Bought to replace the large heavy bulky boot I was given at the hospital. For a lower ankle fracture Weber A injury. I checked with the doctor before wearing. It is light and much more comfortable. Good value compared to some other retailers. Wear a thin cotton sock for comfort and hygiene.",
    "helpful_votes": 1
  },
  {
    "author": "NATTY",
    "rating": 5.0,
    "title": "Great help",
    "date": "2025-04-16",
    "location": "United Kingdom",
    "verified": true,
    "content": "I ordered this to be delivered to Borneo as I broke my foot whilst on a long holiday. I had been fitted with a plaster of Paris cast. The boot arrived 24 hours early and made such a difference. My ankle was already stiff from the lack of movement. The air sacs help to hold my foot securely and I was able to walk more normally. I slept better because I was able to take the walker off at night and able to exercise my ankle a little",
    "helpful_votes": 0
  },
  {
    "author": "millymeeps",
    "rating": 5.0,
    "title": "Wonderful!",
    "date": "2016-04-18",
    "location": "United Kingdom",
    "verified": true,
    "content": "After a very bad non healing Jones fracture I was in a fibre glass cast for 3 months with no load bearing then told 'let's try walking and see how how much pain you are in'. Answer was.......agony!! Two more months in plaster with no sign of bone healing and I hit an all time low. Asked about air casts and was told 'they are great but we won't put you in one, they are too expensive' so I bought my own. So glad I did, walking is still a bit painful but at least I can walk now. I have even been able to go back to work on reduced duties. I can't recommend this aircast enough. If you need it for long term use like me buy the cast socks and a spare cast liner as well as the cast can get very sweaty after a day's use and it's nice to be able to hand wash the liner and have a clean one on hand daily.",
    "helpful_votes": 2
  },
  {
    "author": "Amazon Customer",
    "rating": 1.0,
    "title": "Very poor item and even worse customer service",
    "date": "2017-03-28",
    "location": "United Kingdom",
    "verified": true,
    "content": "Very very poor item.. had it less than two weeks and it has already devolved a fault but what is worse the customer service is even worse and they are not prepared to do anything.. unfortunately we are now having to go to trading standards",
    "helpful_votes": 3
  },
  {
    "author": "G. R. Munro-hall",
    "rating": 5.0,
    "title": "Broken ankle",
    "date": "2012-08-22",
    "location": "United Kingdom",
    "verified": true,
    "content": "Used it when my wife broke her ankle after a trip over the dog. She refused a plaster cast and a helpful nurse unofficially recommended this. It worked really well. She had to find shoes the correct height to compensate for the other foot to stop walking a bit squint but there were plenty of shoes to choose from!",
    "helpful_votes": 10
  },
  {
    "author": "S. Smith",
    "rating": 5.0,
    "title": "So much better than a plastercast.",
    "date": "2016-04-12",
    "location": "United Kingdom",
    "verified": true,
    "content": "Having got knocked over by our 40kg black Labrador, I was put in a temporary plaster cast with crutches for 5 days until I saw the consultant. after one day, my foot was swelling and I was a hazard on crutches. After checking the waiting times at the nearest A&E as it was a Friday night the wait time was over 3 hours and rising with a 2 hr travel time there and back so I removed the cast, ice packed it and rested it. My husband advised me to get one if these Aircasts... Ordered on the Saturday arrived on the Sunday.. It's fabulous I am mobile again with fantastic support. Went to see consultant today and he told me i had a hairline crack in the ankle and that he would have advised an Aircast boot, so all good. Would definitely recommend",
    "helpful_votes": 2
  },
  {
    "author": "RAF",
    "rating": 4.0,
    "title": "The Aircast boot is great..",
    "date": "2017-06-16",
    "location": "United Kingdom",
    "verified": true,
    "content": "The Aircast boot is great .....the problem is the liner wear out pretty quickly the velcro goes ...and they cost £35.00 to change ....come on guys its time to make a better liner or a replacement at a more reasonable price .\nHaving said that this boot is a god send if you have foot problem....and the supplier were prompt and had the best price",
    "helpful_votes": 0
  },
  {
    "author": "Amazon Customer",
    "rating": 5.0,
    "title": "Godsend wouldn't of coped without",
    "date": "2016-11-18",
    "location": "United Kingdom",
    "verified": true,
    "content": "After snapping 3 tendons and rupturing my achillies i was in agony and was only supplied with a splint off the NHS which was no use so I was unable to walk. Once my boot arrived and I put it on my injury instantly felt secure enough to walk and with the blow up cushioning it was comfortable around the swelling and i could put more air in if the ground i was on was unstable so it held my foot perfectly to prevent any pain and stopping the injury getting any worse. Can't recommend this boot enough",
    "helpful_votes": 2
  },
  {
    "author": "BELLA B",
    "rating": 5.0,
    "title": "Highly recommended",
    "date": "2021-09-04",
    "location": "United Kingdom",
    "verified": true,
    "content": "I was badly injured in a house fire and as well as suffering severe burns I also ripped the tendons in my other foot and ruptured my Achilles. Whilst waiting for surgery, my specialist suggested this boot. It is comfortable and holds your foot in place well. Not stylist but really supports my injuries.",
    "helpful_votes": 2
  },
  {
    "author": "L W",
    "rating": 4.0,
    "title": "Comfortable and supportive",
    "date": "2019-07-25",
    "location": "United Kingdom",
    "verified": true,
    "content": "Does what it should. Would have given it 5 starts but found that the liner is getting frayed by the strapping at the back of the boot, which could make a hole eventually",
    "helpful_votes": 0
  },
  {
    "author": "Oxford Hen",
    "rating": 3.0,
    "title": "Second thoughts on previous review",
    "date": "2016-09-09",
    "location": "United Kingdom",
    "verified": true,
    "content": "Have already given this a glowing review when it arrived so quickly and restored my mobility. Now have doubts however as, after only 24hours wear, one of the airbags moved out of position and deflated. Have re-secured it in position and hope it will be OK. At cost of £90.00 really feel it should be replaced, but don't want to be without whilst it is returned. Find not be able to speak to anyone at Amazon about this really frustrating.",
    "helpful_votes": 1
  },
  {
    "author": "P M Samuels",
    "rating": 4.0,
    "title": "a good investment",
    "date": "2017-09-13",
    "location": "United Kingdom",
    "verified": true,
    "content": "Superb item, dose what it's supposed to do, I was unable to walk with out it, had a badly sprained ankle, wore my cast boot for five weeks and am just starting physio now, a good investment",
    "helpful_votes": 0
  },
  {
    "author": "David Darby",
    "rating": 5.0,
    "title": "Excellent and worth every penny",
    "date": "2014-09-17",
    "location": "United Kingdom",
    "verified": true,
    "content": "Highly recommend this product. Some people may consider it to be expensive but I can assure you that it is first class quality and worth every penny. So lightweight yet strong. I am a size ten in shoes and I ordered a medium in this boot and found it to be a snug perfect fit.\nCheck on delivery times. My only complaint is that mine took far to long to arrive. My injury had practically repaired itself before its arrival. Three weeks to arrive from the USA.",
    "helpful_votes": 5
  },
  {
    "author": "Ms D. Milne",
    "rating": 4.0,
    "title": "This boot has been great, it has given me confidence to walk after ...",
    "date": "2014-09-28",
    "location": "United Kingdom",
    "verified": true,
    "content": "This boot has been great, it has given me confidence to walk after a serious break & ligament repair. Without it, ,i would have probably still been stuck in a wheel chair.",
    "helpful_votes": 1
  },
  {
    "author": "Anna",
    "rating": 5.0,
    "title": "If needed: a great purchase",
    "date": "2017-11-01",
    "location": "United Kingdom",
    "verified": true,
    "content": "Excellent quality & worth the money. Helped me to become more mobile & quicker, than using the cumbersome 'ski boot' that the NHS give you. Far more comfortable & much much lighter. Offered more support too as able to adjust the air pockets to suit your foot/ankle size",
    "helpful_votes": 0
  },
  {
    "author": "Beatrice",
    "rating": 5.0,
    "title": "Superb mobility aid",
    "date": "2012-04-17",
    "location": "United Kingdom",
    "verified": true,
    "content": "The aircast walker is light-weight and easy to fit. I suffer from left leg foot drop which is complicated by loss of sensation below the knee. Standard splints have caused pressure sores in the past. This does not happen with this item due to the inbuilt air cushion which provides both support and protection.",
    "helpful_votes": 9
  },
  {
    "author": "Revvview",
    "rating": 5.0,
    "title": "Superb",
    "date": "2017-10-27",
    "location": "United Kingdom",
    "verified": true,
    "content": "Great aid to getting back on your feet. The support and comfort is excellent - and wearing it gives you confidence after injuring your leg. Has a slight rocking motion to it, which enables you to use its momentum to move about.",
    "helpful_votes": 1
  },
  {
    "author": "FRANK ZECCA",
    "rating": 2.0,
    "title": "worked well but did not last",
    "date": "2014-02-09",
    "location": "United Kingdom",
    "verified": true,
    "content": "the air realise button on the side lasted just 3 weeks, so it was a bit of a let down (pardon the pun).",
    "helpful_votes": 6
  },
  {
    "author": "Chris olson",
    "rating": 2.0,
    "title": "Muy mal hecho y los airbags se mueven por todos lados",
    "date": "2025-03-11",
    "location": "Mexico",
    "verified": true,
    "content": "Muy mal hecho y los airbags se mueven por todos lados",
    "helpful_votes": 0
  },
  {
    "author": "LittleRed",
    "rating": 2.0,
    "title": "Many pros but couple of big cons",
    "date": "2025-03-07",
    "location": "United States",
    "verified": true,
    "content": "I was in initially very impressed with this boot. It's very sturdy, the fit is good and it seemed very durable & well put together. I wear it with a knee-high sock and it's fairly comfortable, considering what it is. However, I discovered that the little velcro strips that hold the cloth flaps/pads are not stitched on, they're only attached with adhesive. After a few days of wear, the little strip on the leg part came off and I had to sew it back on to get it to stay. Have you ever hand-sewn velcro? It's not easy. The boot also started making creaking noises when I walk. Now, after only 2 1/2 weeks of wear, one of the cloth flaps/pads across the foot part is coming apart from the boot. For almost $100, I really expected better. I have to wear it for 2 more weeks and I'm crossing my fingers that it will make it. For me, the console outweigh the pros and I don't think I'd buy it again",
    "helpful_votes": 0
  },
  {
    "author": "Amazon customer",
    "rating": 2.0,
    "title": "Disappointed",
    "date": "2025-04-26",
    "location": "United States",
    "verified": true,
    "content": "The boot just didn't hold up the foot bed padding keeps slipping out. After wearing the boot all day it looks like a duck bill sticking out. I will say it's a comfortable boot but it just didn't hold up like the big heavy clunky black cam walking boot.",
    "helpful_votes": 0
  },
  {
    "author": "George C. Moore",
    "rating": 2.0,
    "title": "Look for something with more internal padding.",
    "date": "2025-02-08",
    "location": "United States",
    "verified": true,
    "content": "My orthopedic surgeon ordered this after I had ankle surgery. I found it horribly uncomfortable. I was supposed to sleep in it ( hahaha). IMO it needs more padding around the ankle and a bigger range of sizes. My foot was swimming in it. I bought boot socks to wear under it, which helped a bit. I definitely couldn't sleep I it.\nIt does protect the foot and ankle, which is why I gave it 2 stars.",
    "helpful_votes": 0
  },
  {
    "author": "Bryan",
    "rating": 2.0,
    "title": "Uncomfortable and too hard to put on",
    "date": "2025-02-03",
    "location": "United States",
    "verified": true,
    "content": "Seems like a good design…until you try putting it on. Once you get your workout getting all strapped in and getting the stupid removable hard piece in place, you find there is a painful pressure point about 1/2 way up the boot. Maybe I have a thinner calf than most…there is excess material that hangs loose and the velcro at top is almost not catching to secure because its made to have to fit fat/muscular calves. Returning for PITA to use and discomfort, but might be fine for others.",
    "helpful_votes": 0
  },
  {
    "author": "Edward J Boone",
    "rating": 2.0,
    "title": "Poor construction.",
    "date": "2025-03-17",
    "location": "United States",
    "verified": true,
    "content": "After one week of use, the air pack liners are separating from the hard plastic, nor does the air bleed valve work well. Get the impression this was a return. Had to apply own velcro to a few key areas which had separated from the companion component.",
    "helpful_votes": 0
  },
  {
    "author": "paige",
    "rating": 2.0,
    "title": "lasted less than a month",
    "date": "2025-04-14",
    "location": "United States",
    "verified": true,
    "content": "inexpensive option but you get what you pay for. Wore for less than a month and the balloon on the left side came detached and will not stay inflated. had to purchase a second boot.",
    "helpful_votes": 0
  },
  {
    "author": "Deeanne Brown",
    "rating": 2.0,
    "title": "Great boot! When it arrives intact!",
    "date": "2025-03-03",
    "location": "United States",
    "verified": true,
    "content": "This has been frustrating. The last boot had a badly mounted air bladder, this one was missing the liner. I guess I'll have to take the liner out of the defective boot to make the replacement boot usable. I love the boot itself! It's great for my torn post-tibal tendon tear! It's given me my mobility back! But the reordering process has been a nightmare getting it right!",
    "helpful_votes": 0
  },
  {
    "author": "Rdailey18",
    "rating": 2.0,
    "title": "air does not stay in pockets for long",
    "date": "2025-02-12",
    "location": "United States",
    "verified": true,
    "content": "buying this was alot cheaper then what they would have billed me at the office and it cane next day which was nice. but the air pockets loose air fast, which sucks when i need it. there is nothing wrong with the pockets they just slowly loose air and within 5-10 minutes of being up on my foot the support from the air is gone and i have to pump it up again (and yes i have it turned to \"lock\")",
    "helpful_votes": 1
  }
]
