[
  {
    "author": "Reid Thompson",
    "rating": 5.0,
    "title": "Just get it",
    "date": "2025-04-19",
    "location": "United States",
    "verified": true,
    "content": "My Dr originally gave me an aircast with heel pads. I tried to explain that my angle wasn't really flexing down, just my toes and he brushed it off. On top of that functional shortcoming, wearing a boot not designed for heel pads was incredibly uncomfortable. I immediately did a small amount of research and found this boot that is designed for Achilles injuries. It is 10x more comfortable and actually keep your entire ankle joint in plantar flexion. Also, instead of just decreasing heel pads and keeping your ankle locked, you can set a range of motion as recovery allows. My Dr. did a little contemporary review of accelerated recovery like I did and adopted those protocols for my recovery. Is it expensive? Yeah. Is it cheap compared to everything you're going to spend on your recovery? Absolutely. On top of that, it's the only part of recovery that you are going to have to have on your leg for months so it's worth it.",
    "helpful_votes": 0
  },
  {
    "author": "Jessica Edwards",
    "rating": 4.0,
    "title": "Not for large calves",
    "date": "2025-04-09",
    "location": "United States",
    "verified": true,
    "content": "I had an Achilles takedown and Haglunds deformity surgery. The only reason I gave it 4 stars is because I have large calves and it wouldn't close. I ordered the longer straps and liner extension for my calf. But overall a great product",
    "helpful_votes": 0
  },
  {
    "author": "Tommy",
    "rating": 5.0,
    "title": "Rehab Ease",
    "date": "2022-06-15",
    "location": "United States",
    "verified": true,
    "content": "I didn't start at the traditional flexed position of 30 degrees as per my situation. But I will say the time that I have had it, I've seen tremendous strides toward rehabbing my Achilles. The fact that you're able to simulate the movement inside the boot of walking helps wake your muscles back up, opposed to a std wedge where u just feel like like your walking on your toes. I started at a 10 degree angle after quite some time in a hard cast, and adjust the back portion for positive angle so I don't go past the 10 degree mark. I will say, if you're buying this because you think it'll be more comfortable than ur regular trauma boot. I would say you're 25% right. I don't think there will ever be a \"comfortable\" trauma boot. But it's slightly better than the traditional Air Cast style. I think advertising the sizes could be a tad better in regards to calf size. I got a medium, based on recommendation but my calf is def smaller than the boot wool allows and wouldn't Velcro shut. Ended up stitching some extra Velcro myself and problem solved, but I think the small would've been ideal if I had known. Overall I think it's a very innovative product that WILL help in your Achilles recovery. A tad pricey, but have you ever seen the price of a trauma knee brace🤢. comparatively if you have the money, or insurance to purchase this, do it.",
    "helpful_votes": 12
  },
  {
    "author": "David E.",
    "rating": 5.0,
    "title": "Must Buy For Torn Achilles. Do Not Hesitate.",
    "date": "2019-10-18",
    "location": "United States",
    "verified": true,
    "content": "Regardless of whether you get surgery or not for a torn achilles, this boot will make your life and your rehab much better and easier. It will save you many trips back to your Orthopod to have heel lifts removed, and is worth it for that alone as you will save hours of appointmemts, waiting and driving.\n\nThe most significant benefit is it allows for full range of motion through an adjustable arc as you begin weight bearing inside the boot. With traditional heel lifts you are locked into 30°, 25°, 20° plantarflexed fixed positions. With this boot, you can asjust to any upper and lower position. So in the week you are cleared to go to a 5° lift by your doctor, you can have this boot arc between 30° and 5° range of motion. This is the difference between simulating true walking or having a club foot and your body will thank you.\n\nThere are many other benefits including the ability to swim and bathe in this boot. If you are going non-surgical when you are cleared for weight bearing in boot, you can actually shower on two feet in this boot and just buy an extra liner - after a few weeks of showering on one leg, you will be so happy. IMPORTANT: If you go surgical, get clearance from your surgeon first before wetting the area!\n\nThis boot has been available in other countries for over a decade but only in the United States since 2017. Hence, the limited number of reviews and recognition by virtually all Doctors and therapists at this time. Do not let the number of reviews or lack of general acceptance fool you. This boot will change your life. It is the best money I spent since my injury and I can recommemd it without reservation. Do your research on youtube and the companies website and you will see why. Best wishes for a full recovery.",
    "helpful_votes": 17
  },
  {
    "author": "Martin J. Fleishman",
    "rating": 1.0,
    "title": "Defective boot, customer service is no help.",
    "date": "2023-12-04",
    "location": "United States",
    "verified": true,
    "content": "The boot had a defect where the first picture shows what it should look like, the second pic is what shows the broken part of this boot. Customer service said it would not effect the boot, and do not have anything to replace it with (come on now, what kind of line is that). I guess they are not making a size 10 anymore. Paying almost $300 dollars for this boot I expect it to be made right. Customer service stopped corresponding and are ignoring me know.",
    "helpful_votes": 9
  },
  {
    "author": "sheldon kung",
    "rating": 4.0,
    "title": "great boot",
    "date": "2025-02-23",
    "location": "United States",
    "verified": true,
    "content": "tore my achilles and used this before i got my surgery and after, definitely recommend but I bought this out of pocket, my doctor never heard of this boot before. one star off because this cannot be used with an iwalk crutch since the air bladder nozzle is in the front",
    "helpful_votes": 0
  },
  {
    "author": "Chris D.",
    "rating": 4.0,
    "title": "Terrific product with one design flaw that would so easily be corrected",
    "date": "2023-06-16",
    "location": "United States",
    "verified": true,
    "content": "I ruptured my Achilles tendon. Initially, they put on a cast, which had the advantage of being lightweight and not so bulky that I couldn't get my pants on and off. I've been pretty mobile, using both crutches, and my new favorite transport—a knee scooter.\n\nI've only been using the VasoPed for one day, to replace the cast I started with. The design, overall, I think is brilliant. It's much more comfortable than the cast, and my doctor assures me that I'll heal faster with this than with a cast.\n\nOne minor gripe, and one more important one.\n\nThe minor gripe is that it's very big and heavy. So, I can't get pants on or off (even wide-legged painters pants) without taking off the boot, which my doctor said not to do. I'll have to get a zipper installed on my one pants leg. And, when I'm on crutches it's putting much more strain on my muscles keeping that leg off the ground than the lighter weight cast did.\n\nThe more important gripe is that the VasoPed system involves creating a vacuum inside the lining. To accomplish this they supply a built-in air valve. Here's the dumb part. They put the air valve right near the top in the middle, lined up with my shin. That means that there's no way to use my knee scooter without risking crushing/breaking the valve stem. Presumably, the manufacturer could have put the valve stem off to one side, instead at no additional cost. So, now, I'm forced to give up my favorite assistive device, or figure out some way to protect the valve stem so that I can use the scooter. I consider this a bad design flaw in an otherwise terrific product.",
    "helpful_votes": 26
  },
  {
    "author": "Critic",
    "rating": 3.0,
    "title": "Versatile design, serious flaws",
    "date": "2024-06-17",
    "location": "United States",
    "verified": true,
    "content": "Obviously a thoroughly designed boot, but with a few serious issues.\n\nPros: you already know, heel wedge and ROM adjustability. Probably the swappable heel wedge is the main reason to get the boot if you need that, but adds a lot of weight and complexity.\n\nCons: sizing is ridiculously off - if you're towards the top of range your toes go on a flimsy plastic tray that bears no weight and doesn't protect your toes at all, almost 300 dollars to have your toes half an inch over the boot is insane. No refunds if you've used it so good luck learning their sizing chart the hard way.\n\n+ footbed is hard plastic with no padding\n+ liner offers little padding — it's basically a bunch of massage balls pulled by a partial vacuum. The balls move and bunch up which can injure your feet as you'll have a lot of little balls and in some none (Eg your heel as your weight moves the balls). Apparently you can smooth this out your foot is already sore at this point. I am sure some people manage this issue very effectively, but I don't understand why you would want this over padding.\n\n+ heavier and bulkier than other boots.\n\nNo refunds if you've used it so there's that.",
    "helpful_votes": 1
  },
  {
    "author": "Pineapplehead",
    "rating": 5.0,
    "title": "Got a ruptured achilles? Don't hesitate, just get it!",
    "date": "2022-04-17",
    "location": "United States",
    "verified": true,
    "content": "I'm currently still in this boot. My rehab is going faster than expected. I was able to walk full-weight bearing without crutches 28 days post-op. It took about 7 days from (when I transitioned from cast to boot) partial weight bearing to walking on my own in the boot. I went to Hawaii the next day after being able to be full weight bearing, and in Hawaii I was able to walk without a crutch on average 7-8 miles per day. I was exhausted at the end of the day everyday we were there, but I was able to walk and get around. It does take a lot more energy walking with this boot (it takes a lot of energy walking in any kind of boot). Walking on sand, is almost impossible though, it takes way too much energy and your other leg starts to almost die out. This boot is specifically made for achilles ruptures. It keeps your foot safe from re-injuring it. I felt safe walking around everywhere with this boot. Just listen to your body and don't push it harder than it should.",
    "helpful_votes": 5
  },
  {
    "author": "Kay slavin",
    "rating": 5.0,
    "title": "Achilles rupture post surgery EASY to USE",
    "date": "2024-07-03",
    "location": "United States",
    "verified": true,
    "content": "This boot is very comfortable and easy to use. Only suggestion I would make is if your foot size is towards the higher end of the size chart... go up one size. My husband wears a 10.5 men's shoe so we went with the Med. However, with the swelling the liner does not fit over top of foot. I wish we would have gotten the large size",
    "helpful_votes": 4
  },
  {
    "author": "ay M",
    "rating": 5.0,
    "title": "Incredible comfort",
    "date": "2023-05-24",
    "location": "United States",
    "verified": true,
    "content": "This walking/cast boot is the best I have ever seen. I have been fitting various other brands of walking boots for 27+ yrs, and have had to wear one occasionally after injury.\nI recently ruptured my Achilles tendon and have to wear a boot full time for the next 8-10 weeks. the Vacoped is by far the best boot I have ever seen or experienced. The adjustability of the boot for fit and ankle angle is terrific. And rhe comfort is second to none. Particularly if you have to wear it 100% of the time including to sleep.\nThey are very expensive, compared to most other boots, but they are well worth it.",
    "helpful_votes": 10
  },
  {
    "author": "Catherine Perez",
    "rating": 3.0,
    "title": "Works great for recovery--poorly designed if you're using a cart to get around.",
    "date": "2022-08-10",
    "location": "United States",
    "verified": true,
    "content": "I am now 6 weeks post Achilles-repair surgery and have been wearing this boot since my soft cast was removed at 2 weeks post surgery. I have been approved to do 25% weight-bearing exercises in PT and the function to adjust the foot angle has been very helpful. Surgeon anticipates I will be able to transition to a shoe with heel lifts at the 10 week mark. Overall, this device has aided in m recovery.\n\nDESIGN ISSUE: The air-valve for this device sits at the top of my shin, about 5-6 inches below my knee. I have to use the mobility cart to get around for work (Knee Rover), and the air valve is positioned exactly where my leg sits on the cart cushion. This is extremely uncomfortable and leaves bruises in that area. Developers/designers need to consider moving the valve to the side of the device so that both items can comfortably be used together.\n\nCOST: This device is really sturdy, but I don't believe it is $300 worth of sturdy. I would recommend a price point closer to $200 to reflect the value vs getting the cheaper options.",
    "helpful_votes": 13
  },
  {
    "author": "ToolmanJohn",
    "rating": 5.0,
    "title": "Comfortable, adjustable from 0-30 degrees. For Achilles surgery recovery after the cast or splint.",
    "date": "2020-07-23",
    "location": "United States",
    "verified": true,
    "content": "Very nice comfortable after the learning curve to get it on and vacuum the air out of the bladder. It is straight up impossible to walk with this at 20-30 degrees of foot angle. One would require a 3-4 inch lift on the other shoe to equalize the height difference.\nThat said, it is EASY to take off. VERY fast no issues. But it takes well over a minute or two to get it on. First is the liner, which may not require the vacuum pump again, but it might. THEN getting the lined foot into the boot frame, THEN putting the front cage around the liner and installed correctly, THEN strapped correctly so as not to pinch the liner valve. Finally the boot is on. Sheesh. Difficulty if you are not young and flexible, I have to do it sitting on a the top of the stairs.\nBut I would buy it again. It does what it is supposed to do. Restrains the foot in flexion for proper Achilles Tendon healing.\n\nAlso: My doctor was the person who highly recommended this boot.",
    "helpful_votes": 11
  },
  {
    "author": "wesley alan parker",
    "rating": 5.0,
    "title": "This should be standard of care for Achilles injuries.",
    "date": "2023-05-27",
    "location": "United States",
    "verified": true,
    "content": "If your ortho does not offer this as a solution for an Achilles rupture or strain, they should. Easily the best solution for an Achilles rupture. My ortho put me in a breg walking cast which did exactly Jack squat to relieve pressure on my Achilles and was designed for a broken foot. My life has become much easier since I've bought this. It was pricey, but I'll be in it for 10-12 weeks which it's easy to make that choice. That said my physical therapist says my progress is way ahead of schedule. I credit it to this amazingly designed German piece of engineering.",
    "helpful_votes": 10
  },
  {
    "author": "sandra",
    "rating": 5.0,
    "title": "Awesome Boot",
    "date": "2024-08-05",
    "location": "United States",
    "verified": true,
    "content": "Excellent product. It arrived on time and it fitted well and I am immensely pleased. Comfortable, and secure.",
    "helpful_votes": 0
  },
  {
    "author": "Ryan Cavazos",
    "rating": 5.0,
    "title": "Great boot",
    "date": "2023-02-28",
    "location": "United States",
    "verified": true,
    "content": "Very comfortable (as far as boots go) and we'll built. Mine came with two liners. The first has an internal air bladder. If you require an air cast, your covered.\n\nIt also has a regular liner that is ver comfortable and washable. This liner does not have an air inlet that would interfere with a knee scooter or similar walking aid and can be used quite comfortably with those mobility devices.\n\nI'm using mine for an Achilles injury. I like that you can adjust the foot angle and lock it in without the need to use foot wedges.",
    "helpful_votes": 5
  },
  {
    "author": "Anna",
    "rating": 5.0,
    "title": "Quality",
    "date": "2022-10-18",
    "location": "United States",
    "verified": true,
    "content": "It took me a few tries to find a good fit, but once I did I was amazed at how mobile I was! I ruptured my Achilles and went from a cast (2 weeks) to this boot, no surgery. It helps to watch the tutorial video on how to put it on correctly. I purchased the evenup shoe, which is also a must, especially for an 8-10 week recovery\nIt is less comfortable at night- I had to loosen it to sleep and tighten it again to walk on it in the morning.\nI love that it comes with two insert sleeves and two keys!",
    "helpful_votes": 5
  },
  {
    "author": "SWSmith",
    "rating": 5.0,
    "title": "Great Achilles boot",
    "date": "2023-06-19",
    "location": "United States",
    "verified": true,
    "content": "This boot was a replacement to the standard black boot used for these injuries (ruptured Achilles tendon). There is no comparison! This boot is MUCH more comfortable and holds everything where it needs to be. It also helps control the swelling. Best thing I've done so far in recovering from the injury. Worth the money.",
    "helpful_votes": 3
  },
  {
    "author": "Deborah",
    "rating": 4.0,
    "title": "Not quite right",
    "date": "2023-07-25",
    "location": "United States",
    "verified": true,
    "content": "I think I should have gone up to a Large. I wear a size 11 shoe, but a large \"Bregg\" boot was too big. I got a medium.",
    "helpful_votes": 0
  },
  {
    "author": "Unhappy buyer",
    "rating": 5.0,
    "title": "Best product for such serious injury",
    "date": "2022-06-19",
    "location": "United States",
    "verified": true,
    "content": "This casque was very helpful at every stage while keeping for straight. The options to change angle of the boot was essential in knowing what stage I was reaching. I would recommend this to anyone with serious achilles injury. Your product of choice Canale a bog difference.",
    "helpful_votes": 1
  },
  {
    "author": "choco",
    "rating": 5.0,
    "title": "lightweight and comfortable",
    "date": "2023-09-21",
    "location": "United States",
    "verified": true,
    "content": "I purchased three and this is definitely the best. Expensive but does make a difference.",
    "helpful_votes": 0
  },
  {
    "author": "Chris",
    "rating": 5.0,
    "title": "Better then a cast!",
    "date": "2022-10-14",
    "location": "United States",
    "verified": true,
    "content": "Tried several other boots after my Achilles tendon surgery.. This one gave me the ability to walk in the mountains, and go mt biking with it!",
    "helpful_votes": 1
  },
  {
    "author": "Wingary",
    "rating": 5.0,
    "title": "With The Money",
    "date": "2020-06-16",
    "location": "United States",
    "verified": true,
    "content": "Felt extremely confined using it after right achilles tendon surgery. My ortropedist really liked the boot by saying \"It's better than anything we have\". Would have to accepted a inferior booth since I am on a medicare Advantage plan.",
    "helpful_votes": 2
  },
  {
    "author": "Dr. Kylea Woodley-Jones",
    "rating": 1.0,
    "title": "Upgrade but a few flaws.",
    "date": "2023-08-20",
    "location": "United States",
    "verified": true,
    "content": "Updated: my husband barely does anything and we've now had a 2nd insert pop. This is ridiculous. Overall a nice boot. The issue is that the replacement parts are extremely expensive. The plastic insert popped within a few weeks and we had to spend $68 on a replacement. We did choose to get 2 addition gray parts as well. Helps to keep things clean and fresh. I really wish they would make the white part better or at least include a replacement.",
    "helpful_votes": 3
  },
  {
    "author": "Boo Pate",
    "rating": 5.0,
    "title": "Boot for recovery of Achilles",
    "date": "2020-03-21",
    "location": "United States",
    "verified": true,
    "content": "Best food around for Achilles recovery and injury!",
    "helpful_votes": 1
  }
]
