[
  {
    "stars": 1,
    "title": "Product does not work",
    "body": "This sleeping brace for Achilles tendon rupture did not fit right and would not stay on through the night. I would have returned it but there were no return instructions and no return shipping label. For several nights I have tried different levels of tightness, socks/no socks, etc with no success. A total failure!"
  },
  {
    "stars": 1,
    "title": "10 Mins maximum",
    "body": "The device sounded great but in practice it makes my toes and foot go numb in 10 minutes. Tried sleeping in it and initially was great but when I woke my foot was totally numb. Took over half an hour to recover. So I use for 10 mins max to give my foot relief from the big heavy boot. So not value for money from my experience."
  },
  {
    "stars": 2,
    "title": "Too loose, too tight, never fits right",
    "body": "Woke me up a couple nights in pain from cutting of circulation to my foot. Bands are to thin. They do not evenly distribute the pressure needed to support the foot. When the straps were looser, the brace would provide little to no support. It then became just annoying to sleep with. There was no middle ground, I regret the purchase."
  },
  {
    "stars": 2,
    "title": "Needs improvement",
    "body": "Splint needs to be contoured better with maybe hinge/knob for different degrees of plantar flexion. Not worth price tag."
  },
  {
    "stars": 3,
    "title": "Unsure",
    "body": "I have given this 3 stars as I have found the ankle straps slip off my ankle at night. The only way to keep it on is to put it on very tightly & that is too uncomfortable to sleep. I have resorted to bandaging the splint in place but I am concerned because the nights where the ankle straps have slipped have allowed my foot to move so I’m not sure whether I have caused damage. I return to the hospital next week so I should have the answer & will update this review once I know the outcome."
  },
  {
    "stars": 3,
    "title": "Great idea, but too pricey and poorly executed.",
    "body": "IN SHORT: This splint is a great idea. It is light and holds your foot in the appropriate downward position and helps you sleep more comfortably. Unfortunately, the straps are poorly designed causing unnecessary pressure on your tendon and calf muscle, which at this price, cannot be forgiven. REVIEW: This splint was a life saver. I ruptured my left Achilles tendon a few weeks ago and was given a medical boot. As many of you know, a medical boot is heavy and clunky. It was causing me to develop knee pain especially while sleeping. It was also kind of gross sleeping with a dirty boot that had been all over the floor. PROS: The boot is light and well designed, keeping my foot in the proper downward position. I immediately slept more comfortably and within a few days eliminated my knee pain. The materials seem sufficiently good for a simple item like this. The padding on the inside is soft but sturdy and it extends beyond the outer shell which prevents the harder material from pressing against your leg. It comes with three straps, two permanently sewn into the splint and one that is separate. The top strap goes around the calf and the bottom one goes around the arch and sole. The middle strap, which is not sewn in, goes around the heel and has a split in the center to fit your heel into. The material of the straps is on par with that of other straps. All straps attach with Velcro. It is not recommended you walk with this splint on. It is only for sleeping. CONS: I'm not a big guy per se, but definitely bigger than the average person. I originally ordered a small by mistake. When I first put it on I noticed it felt really tight around the bottom of my calf where it meets the Achilles tendon (top strap). This was not good, you do not want pressure on that area. It should fit snug, but never tight. I quickly realized my mistake and ordered the large one. It was physically much larger (see pictures). Unfortunately, the straps themselves are the same size for both splints (see pictures). This is the first major design flaw. The small splint wrapped around where the calf met the Achilles tendon, the large splint wraps around the calf muscle itself. Since the strap is not larger it ends up being even tighter than the smaller splint. The second design flaw is that the straps themselves are designed to make pressure through stretching which is not ideal. It is better for them to be adjustable like the straps on medical boots. This leads me to the most important con which is price. This splint costs $59.99. At this price point, it should at the very least have adjustable straps. Not to mention they didn't even care enough to provide larger straps on the larger model. TO THE MAKER: You have unique product with potential. Despite the flaws, I decided to keep the splint since there isn't another one like it on the market. I use one of the adjustable straps from my boot instead of the super tight one on the splint. If you redesign the splint with adjustable straps you'll have a winner on you hands."
  },
  {
    "stars": 3,
    "title": "Good, in theory",
    "body": "This was exactly what I was looking for: something to keep my foot pointed down while I slept so I wouldn’t have to wear the boot. This did that, and it’s well-made. Unfortunately, part of the strap that anchors onto the heel rubbed against where my Achilles tendon was trying to heal and caused a bit of pain, so I returned this product. YMMV."
  },
  {
    "stars": 3,
    "title": "Heel strap is too large. Somewhat uncomfortable.",
    "body": "What I liked was that it wasn't a boot. I walk outside with the boot, and I wouldn't go to bed with it on even if I wiped it down. Conceptually, a splint makes sense. What I had most difficulty with was the heel strap, made from two 1'x3' elastic, when stretched would work up to my ruptured Achilles tendon. My eventual solution was to tape it. The foot end is asymmetrical and tends to rotate. The urethane foam padding was didn't contour to my bony leg. I wished it was silicone gel instead. Others have complained about the price. I am glad my tendon has healed far enough (week 4), that I no longer need it in bed."
  },
  {
    "stars": 3,
    "title": "Good, in theory",
    "body": "This was exactly what I was looking for: something to keep my foot pointed down while I slept so I wouldn’t have to wear the boot. This did that, and it’s well-made. Unfortunately, part of the strap that anchors onto the heel rubbed against where my Achilles tendon was trying to heal and caused a bit of pain, so I returned this product. YMMV."
  },
  {
    "stars": 3,
    "title": "Could be useful",
    "body": "I bought it before surgery. But after the ankle surgery, I have the splint applied by the doctor. Did not use it since then. For people without surgery it may help recovery when resting."
  },
  {
    "title": "DAO",
    "stars": "4.0 out of 5 stars",
    "review": "Finally got some sleep",
    "date": "28 October 2023",
    "size_name": "Large",
    "hand_orientation": "Left",
    "verified_purchase": true,
    "content": "This device saved me. I could not sleep in the foot recovery boot which I was required to wear at all times, even in bed. I was suffering with zero sleep. I tried this night splint and was able to get a good night's rest. It was night and day for sure. It was way lighter and so much more comfortable. It is not cheap, but it was worth every penny.",
    "report": "Amazon Customer"
  },
  {
    "title": "Amazon Customer",
    "stars": "4.0 out of 5 stars",
    "review": "Pressure Point on Heel",
    "date": "30 July 2023",
    "size_name": "Large",
    "hand_orientation": "Left",
    "verified_purchase": true,
    "content": "Excellent product except for one thing. May not be suitable for all folks suffering from a ruptured Achilles tendon. When tensioning the split heel strap in order to prevent foot from bending, one half of the strap puts pressure on the heel bone. In my case, the heel bone is sore and inflamed, and the split heel strap puts pressure directly on the injury. I can loosen the strap but that defeats its purpose. Will be saving the splint for down the road when the injury no longer causes pain.",
    "report": "TAW"
  },
  {
    "title": "TAW",
    "stars": "4.0 out of 5 stars",
    "review": "This thing is pricey but worth it.",
    "date": "11 November 2022",
    "size_name": "Large",
    "hand_orientation": "Right",
    "verified_purchase": true,
    "content": "I am cheap and I don’t expect to tear my right Achilles again - this was a hard purchase for me to stomach but I am so glad I decided to pull the trigger. Sleeping in a boot or ER splint was very uncomfortable and kind of gross, this splint is simple and works very well - I sleep so much better with it. Be prepared to have to play around with positioning a bit to get the most comfortable set up for the first time using it. You’ll be glad to have this when it’s time to go to bed.",
    "report": null
  },
  {
    "title": "Liz",
    "stars": "4.0 out of 5 stars",
    "review": "Comfortable Alternative",
    "date": "30 May 2022",
    "size_name": "Small",
    "hand_orientation": "Right",
    "verified_purchase": true,
    "content": "I have a ruptured Achilles and needed something to use at night instead of my boot. This splint gives just enough support while I sleep, is lightweight and lets my skin breathe. You cannot put any weight on your foot (always kept my boot within hands reach) while wearing this so keep that in mind. I also advise not strapping it too tightly. I would have given it 5 stars but I feel the price is high.",
    "report": "C. Huntington"
  },
  {
    "title": "C. Huntington",
    "stars": "4.0 out of 5 stars",
    "review": "Nice design, it works, but overpriced",
    "date": "8 September 2022",
    "size_name": "Small",
    "hand_orientation": "Right",
    "verified_purchase": false,
    "content": "This is a very good design to support and protect. The product is very lightweight. Finally, something you can wear for nighttime to give you protection, but give your foot a break. For the long recovery time, you can get your sleep back. For how simple and based the material are, this product is overpriced, but it is working and life-saving, I will only take one star off.",
    "report": null
  },
  {
    "title": "MC, Romania",
    "stars": "4.0 out of 5 stars",
    "review": "Good product for early post-surgery weeks",
    "date": "28 September 2023",
    "size_name": "Large",
    "hand_orientation": "Left",
    "verified_purchase": true,
    "content": "I ordered this splint and arrived after a few days, but I was already 5 weeks after surgery. Already wearing an Ossur Rebound Air Walker, with 5 wedges. I believe the splint would have been great for earlier stages; right now I cannot use it because the position of my foot is not at maximum equine. Therefore, I would advise for usage very early, before starting to take out wedges. Otherwise, great product, good quality, balanced price (no other comparable option).",
    "report": "Helpful"
  },
  {
    "title": "jason clarke",
    "stars": "4.0 out of 5 stars",
    "review": "Great product",
    "date": "25 June 2022",
    "size_name": "Large",
    "hand_orientation": "Right",
    "verified_purchase": true,
    "content": "Bought as only product type could find. Great product supports foot well, easy to use light and comfortable",
    "report": null
  },
  {
    "title": "Milliemoofashionista",
    "stars": "5.0 out of 5 stars",
    "review": "Splint that does the job",
    "date": "5 March 2023",
    "size_name": "Small",
    "hand_orientation": "Right",
    "verified_purchase": true,
    "content": "I read the reviews for the night splint but no one said much about foot size or leg length. As I am a size 3.5 (36) UK size feet and only 5 feet tall (short legs) I was rather undecided whether the small would fit as it is advertised smaller than a size 8 which is a lot bigger than I am. As you will see from the photo it fits perfectly and keeps my ruptured Achilles in place while I sleep. This is a great step forward (sorry about the pun) as although I had found a way of sleeping with my boot on, this works much better. It’s lighter for a start and keeps my foot supported at the right angle. The splint sits in place with the straps done up and they don’t need to be too tight to keep it secure. I wear an ankle support under it as my foot gets cold and this also seems to help keep it secure. I’m not sure about the size 8 cut off for sizing though, as I think someone with a longer leg, and bigger foot than me might need the large to get the ankle strap in the right place. You must not use the splint to weight-bear so I only use it for sleeping or resting. As a doctor and psychologist I’ve found my ruptured Achilles incredibly frustrating so having the splint offers a bit of comfort in miserable circumstances. The price reflects the special nature of the product, though I recognise that not everyone is as fortunate as I am and maybe totally reliant on NHS-provided aids. I found the splint through the Achilles rupture e book by Matthew Solan and if you are looking for good info on this injury the e book is definitely worth a read. If you are reading this because like me you have ruptured your Achilles I empathise and wish you well with your recovery. Please do follow your doctor’s instructions to get it soonest mended.",
    "customer_image": true,
    "helpful_count": 4,
    "report": "Helpful"
  },
  {
    "title": "M. D. Taylor",
    "stars": "5.0 out of 5 stars",
    "review": "Worth it!",
    "date": "4 August 2023",
    "size_name": "Large",
    "hand_orientation": "Right",
    "verified_purchase": true,
    "content": "If you've ruptured your Achilles tendon... Commiserations! It's not fun. And it's not a quick recovery. You will have been given a Controlled Ankle Movement (CAM) boot and, after wearing it all day, there's no respite at night. Like me, you might find that sleeping in the boot is even harder than walking in it. It's hot. Things you don't notice during the day suddenly become impossible to ignore: a bit of pressure here, a bit of rubbing there. And you can't sleep. This is exactly what the night splint is designed to solve. And it works.\n\nAs others have noted, the splint is not cheap, but it's a niche product, made by a small company, and there's little scope for economies of scale. You're paying for the expertise that went into its design too. In my view, it's worth every penny. It took me a bit of fiddling around making minor adjustments to the position and tightness of the straps to get it comfortable. It's a case of balancing security and comfort. I prioritized security and, the first night, I had tightened the strap that goes under the foot a little too much and, as a result, the splint was pressing on the top of my foot too much for a whole night's comfort. I was also concerned that the strap at the heel might cause problems, but it hasn't. In the end, I've found that I'm actually having the heel strap a little tighter than the calf and foot straps and that's got the balance between security and comfort about right. I've still found that a cotton wool make-up pad, half under the splint, at the edge nearest my small, outer toes helps: everyone's feet are different and I found that was a bit of a pressure point. However, it's worth the effort: I've been able to sleep well and the splint has remained secure. The recovery of my Achilles tendon remains on track too.\n\nIn summary, then, this has been a very worthwhile purchase. It's a good example of a small company that's identified a problem and provided a solution. (Note: the Thetis website is also an excellent source of information about Achilles tendon injuries and recovery.) I would also suggest searching for the Evenup Shoe Balancer on Amazon: another helpful product but one that makes walking with a CAM boot a bit easier.",
    "helpful_count": 2,
    "report": "Helpful"
  },
  {
    "title": "Sid",
    "stars": "5.0 out of 5 stars",
    "review": "Really good for ruptured Achilles tendon",
    "date": "8 May 2023",
    "size_name": "Large",
    "hand_orientation": "Right",
    "verified_purchase": true,
    "content": "Following a ski accident which snapped my Achilles, returning from an operation in a vacoped boot, which is hard to sleep in I decided it's worth giving it a go as it's not cheap. It is comfortable and keeps your foot in the right position with no load on the tendon.\n\nSo…..loads loads easier to sleep in that's for sure.\n\nI wore a sock as the straps as it made the straps more comfortable.\n\nI would deffo say go for it, if you're reading this then you will understand how difficult the boot is to sleep in.\n\nGood luck",
    "helpful_count": 1,
    "report": "Helpful"
  },
  {
    "title": "Amazon Customer",
    "stars": "5.0 out of 5 stars",
    "review": "I'm relieved this exists",
    "date": "24 May 2023",
    "size_name": "Large",
    "hand_orientation": "Right",
    "verified_purchase": true,
    "content": "This splint has proved the difference between a good night's sleep and barely any sleep at all. Wearing it at other odd times that the boot is inconvenient also gives me confidence that I won't unexpectedly pull my foot upwards.\n\nThis is a recent, unique product and maybe future iterations will use more comfortable materials but after a week's use it's felt quite natural. I wasn't sure initially about one of the upper spurs of the heel strap, specifically whether it was pulling on the tendon. However not pulling this strap too tight has made this a non-issue. I'm a size 8 so just at the mid-point and a large has felt fine.",
    "helpful_count": 1,
    "report": "Helpful"
  },
  {
    "title": "taehee lee",
    "stars": "5.0 out of 5 stars",
    "review": "Highly recommended",
    "date": "2 March 2023",
    "size_name": "Large",
    "hand_orientation": "Left",
    "verified_purchase": true,
    "content": "It is really helpful for the night.\nI would highly recommend it.\nOne thing I want to suggest that stripe for the heel was a bit tight and small gap so if it could be a bit more big will be perfect.",
    "helpful_count": 1,
    "report": "Helpful"
  },
  {
    "title": "Mattpg915",
    "stars": "5.0 out of 5 stars",
    "review": "Expensive, but worth it.",
    "date": "2 July 2022",
    "size_name": "Large",
    "hand_orientation": "Left",
    "verified_purchase": true,
    "content": "I ruptured my Achilles and spent 3 weeks \"In the boot\" before I finally gave in with lack of sleep and started to research products like this.\n\nI was swayed by the positive reviews on this product and took the plunge, it has genuinely been the single best decision I have made in my recovery so far, its light, easy to fit and comfortable (as long as you don't overtighten the straps). My physio has said this is fine to use when resting/sleeping but obviously not for weight bearing (which is stated *in bold*, in the instructions).\n\nIf you're struggling to sleep in your heavy Achilles boot and your significant other is fed up of being knocked and poked by the cumbersome boot then I'd definitely recommend purchasing one of these.",
    "helpful_count": 2,
    "report": "Helpful"
  },
  {
    "title": "REM",
    "stars": "5.0 out of 5 stars",
    "review": "A Must",
    "date": "24 May 2023",
    "size_name": "Large",
    "hand_orientation": "Left",
    "verified_purchase": true,
    "content": "This boot was an excellent buy. I have a ruptured Achilles and this allows me to remove the big boot on occasion, just make sure you keep your toes forward during transition, someone to help would be an advantage too. Would recommend, but as the product states, “only for a ruptured Achilles.\n\nREM",
    "helpful_count": 1,
    "report": "Helpful"
  },
  {
    "title": "John In Sussex",
    "stars": "5.0 out of 5 stars",
    "review": "Night time savior",
    "date": "15 May 2022",
    "size_name": "Large",
    "hand_orientation": "Right",
    "verified_purchase": true,
    "content": "This is a savior for night time wearing. So much easier than the big boot. You need to be careful of getting up. I started using a crutch initially but as confidence grew just tried to ensure that I was careful. Five weeks down and another five or six to go. Would have struggled with the full boot.",
    "helpful_count": 1,
    "report": "Helpful"
  },
  {
    "title": "Geoff Mayer",
    "stars": "5.0 out of 5 stars",
    "review": "Comfortable and perfect for sleep",
    "date": "3 March 2022",
    "size_name": "Large",
    "hand_orientation": "Left",
    "verified_purchase": true,
    "content": "Having ruptured my right Achilles 3 years ago and wearing my boot 24/7 for 12 weeks there was no product like this available. Sadly I ruptured my left Achilles recently and on advice of my consultant bought this device for night time. The improvement in the quality of sleep has been significant. It provides the perfect amount of support and is comfortable.\n\nHighly recommended",
    "helpful_count": 2,
    "report": "Helpful"
  },
  {
    "title": "Paul2",
    "stars": "5.0 out of 5 stars",
    "review": "Peace of mind for Achilles injuries",
    "date": "22 June 2022",
    "size_name": "Large",
    "hand_orientation": "Left",
    "verified_purchase": true,
    "content": "A great alternative to wearing the walking boot to bed, without worrying about inadvertently straightening or knocking your foot.\n\nIt is far more comfortable too, and the fact that it is being worn is a nice reminder in the morning to stop you jumping out of bed too quickly.",
    "helpful_count": 1,
    "report": null
  },
  {
    "title": "Louise S.",
    "stars": "5.0 out of 5 stars",
    "review": "Wonderful device and splendid service.",
    "date": "18 November 2022",
    "size_name": "Large",
    "hand_orientation": "Left",
    "verified_purchase": true,
    "content": "Brilliant device. Arrived the day after it was ordered. Delighted in all respects.",
    "helpful_count": null,
    "report": "Helpful"
  },
  {
    "title": "Cat",
    "stars": "5.0 out of 5 stars",
    "review": "Alternative to sleeping in that big boot!",
    "date": "14 July 2022",
    "size_name": "Small",
    "hand_orientation": "Left",
    "verified_purchase": true,
    "content": "During summer, I was finding that big boot for protecting my leg too hot. I got approval from a Dr that using this when sleep from week 4 would be fine. It has made such a difference!",
    "helpful_count": 2,
    "report": "Helpful"
  },
  {
    "title": "lorraine whittaker",
    "stars": "5.0 out of 5 stars",
    "review": "Achilles heel",
    "date": "16 December 2022",
    "size_name": "Large",
    "hand_orientation": "Right",
    "verified_purchase": true,
    "content": "Helpful item but overpriced",
    "helpful_count": null,
    "report": "Helpful"
  },
  {
    "title": "jeremy pack",
    "stars": "5.0 out of 5 stars",
    "review": "Just perfect in a bad situation",
    "date": "9 September 2022",
    "size_name": "Large",
    "hand_orientation": "Right",
    "verified_purchase": true,
    "content": "This is a great idea, wasn’t looking forward too keeping the aircast boot on all day and night.",
    "helpful_count": null,
    "report": "Helpful"
  },
  {
    "title": "mr jonathan d potter",
    "stars": "5.0 out of 5 stars",
    "review": "Well designed product.",
    "date": "6 July 2022",
    "size_name": "Large",
    "hand_orientation": "Left",
    "verified_purchase": true,
    "content": "This product is well designed. It gives good protection to the injured Achilles’ tendon whilst sleeping. Allows much better sleep compared to the pressure boot.",
    "helpful_count": null,
    "report": "Helpful"
  },
  {
    "title": "Mr J",
    "stars": "5.0 out of 5 stars",
    "review": "Great",
    "date": "30 July 2022",
    "size_name": "Large",
    "hand_orientation": "Right",
    "verified_purchase": true,
    "content": "Basic item but very good for sleeping without the boot, so much more comfortable",
    "helpful_count": null,
    "report": "Helpful"
  },
  {
    "title": "Avi Tchiprout",
    "stars": "5.0 out of 5 stars",
    "review": "Could not survive without this item",
    "date": "26 May 2022",
    "size_name": "Large",
    "hand_orientation": "Left",
    "verified_purchase": true,
    "content": "This item saved me from going crazy with a boot following my operation to fix my leg.",
    "helpful_count": null,
    "report": "Helpful"
  },
  {
    "title": "Dave Allen",
    "stars": "5.0 out of 5 stars",
    "review": "Expensive",
    "date": "6 April 2022",
    "size_name": "Small",
    "hand_orientation": "Left",
    "verified_purchase": true,
    "content": "Excellent, much more comfortable than wearing the NHS Boot at night, bit expensive for what it is.",
    "helpful_count": 1,
    "report": "Helpful"
  },
  {
    "title": "PFGL",
    "stars": "5.0 out of 5 stars",
    "review": "A welcome relief from the boot",
    "date": "28 May 2022",
    "size_name": "Large",
    "hand_orientation": "Left",
    "verified_purchase": true,
    "content": "I'm glad my consultant recommended this as it makes sleeping much easier.",
    "helpful_count": null,
    "report": "Helpful"
  },
  {
    "title": "Mr Richard Dowkes",
    "stars": "5.0 out of 5 stars",
    "review": "Protects during sleep but lets your leg breathe",
    "date": "17 May 2022",
    "size_name": "Large",
    "hand_orientation": "Right",
    "verified_purchase": true,
    "content": "Lightweight yet supportive, allows for a good night's sleep",
    "helpful_count": null,
    "report": "Helpful"
  },
  {
    "title": "Mrs. C. Swarfield",
    "stars": "5.0 out of 5 stars",
    "review": "Much better than sleeping in a boot.",
    "date": "15 January 2022",
    "size_name": "Small",
    "hand_orientation": "Right",
    "verified_purchase": false,
    "content": "This is a unique piece of kit. Deceptively light - this splint is ideal for night time use to aid recovery and is so much more comfortable than trying to sleep in a boot. Surgically recommended this brace is so clever in its design and function.\n\nI read about this and decided to get it for my best friend in the hope that it aids her recovery and that she sleeps better with this instead of wearing a cumbersome and uncomfortable boot.",
    "helpful_count": null,
    "report": null
  }
]
